# WallNegativeHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..WallNegativeHeight Property
BuiltInFailures..::..WallFailures Class See Also
---
The top of the Wall is lower than the base of the Wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WallNegativeHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallNegativeHeight As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WallNegativeHeight {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace